       IDENTIFICATION DIVISION.

       PROGRAM-ID. PROGRAMA-V06.

       AUTHOR GERARDO-TORDOYA.
       DATE-WRITTEN "2024-04-21".
       DATE-MODIFIED "2024-04-21".
       DATE-COMPILED "2024-04-21".
       INSTALLATION "ACME CORPORATION".
       SECURITY "OPEN SOURCE".
       REMARKS "PROGRAMA DE APRENDIZAJE PARA EL SUB-VIDEO 6".

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Programación Fácil"
            STOP RUN.
       END PROGRAM PROGRAMA-V06.
